
# Завдання 5. Візуалізація обходу бінарного дерева

# Використовуючи код із завдання 4 для побудови бінарного дерева, необхідно створити програму на Python,
# яка візуалізує обходи дерева: у глибину та в ширину.
# Вона повинна відображати кожен крок у вузлах з різними кольорами, використовуючи 16-систему RGB (приклад #1296F0).
# Кольори вузлів мають змінюватися від темних до світлих відтінків, залежно від послідовності обходу.
# Кожен вузол при його відвідуванні має отримувати унікальний колір, який візуально відображає порядок обходу.
#  👉🏻 Примітка. Використовуйте стек та чергу, НЕ рекурсію


